# Начало
hi = "Привет, {name}!"

# Регистрация
choose_role = "Укажи кто ты:"
jury = "Жюри"
captain = "Капитан команды"

# Регистрация жюри
enter_jury_code = "Введите код для жюри:"
unknown_jury_code = "Неверный код жюри, введите снова."

# Регистрация команды
start_team_sign_up = "Начнем регистрацию твоей команды!"

enter_team_name = "Введи название команды:"
enter_capitan_name = "Введи своё ФИО:"
enter_group = "Пришли номер своей группы:"
enter_number_members = "Укажи количество участников в твоей команде(не включая себя):"
enter_member_name = "Введи ФИО {number} участника:"
enter_member_group = "Введи группу {number} участника:"
enter_message_group = "Введи пожелания группы:"

# Проверка данных
check_group_data = "Проверь данные для регистрации группы:"
correct_data = "Всё ок"
change_data = "Изменить данные"

# Изменение данных
kind_of_data_to_change = "Какие данные ты хочешь изменить?"
captain_data = "Данные капитана"
member_data = "Данные участника"
team_name_data = "Имя команды"
message_data = "Пожелания"

# Пользовательское соглашение
agree_user_agreement = "Для завершения регистрации прими пользовательское соглашение пользовательское соглашение: {ref}"
accept = "Принимаю"
not_accept = "Не принимаю"

cancel_sign_up = "Отмена регистрации"
success_sign_up = "Регистрация команды {name} прошла успешно!"

# Получение темы
distribution_topic = "Была проведена жеребьевка тем. Ваша тема: {topic}"

#Интерфейс капитана
see_team_data = "Просмотр данных команды"
load_video = "Загрузить видео"
#change_data выше
upload_video = "Пришли мне своё видео"

# Интерфейс жюри
check_unapprecieated_videos = "Проверить наличие видео"

#Нужно дописать интерфейс жюри, но мы пока не знаем критерии оценки и тд




