# Начало
hi = "Привет, {name}!"

# Регистрация
choose_role = "Укажи кто ты:"
jury = "Жюри"
captain = "Капитан команды"

# Регистрация жюри
enter_jury_code = "Введите код для жюри:"
unknown_jury_code = "Неверный код жюри, введите снова."

# Регистрация команды
start_team_sign_up = "Начнем регистрацию твоей команды!"

enter_team_name = "Введи название команды:"
enter_capitan_name = "Введи своё ФИО:"
enter_group = "Пришли номер своей группы:"
enter_number_members = "Укажи количество участников в твоей команде(не включая себя):"
enter_member_name = "Введи ФИО {number} участника:"
enter_member_group = "Введи группу {number} участника:"
enter_message_group = "Введи пожелания группы:"

# Проверка данных
check_group_data = "Проверь данные для регистрации группы:"
correct_data = "Всё ок"
change_data = "Изменить данные"

# Изменение данных
kind_of_data_to_change = "Какие данные ты хочешь изменить?"
captain_data = "Данные капитана"
member_data = "Данные участника"
team_name_data = "Имя команды"
message_data = "Пожелания"

# Пользовательское соглашение
agree_user_agreement = "Для завершения регистрации прими пользовательское соглашение пользовательское соглашение: {ref}"
accept = "Принимаю"
not_accept = "Не принимаю"

cancel_sign_up = "Отмена регистрации"
success_sign_up = "Регистрация команды {name} прошла успешно!"

# Получение темы
distribution_topic = "Была проведена жеребьевка тем. Ваша тема: {topic}"

# Интерфейс капитана
see_team_data = "Просмотр данных команды"
load_video = "Загрузить видео"
# change_data выше
upload_video = "Пришли мне своё видео"

user_already_registered = "Вы уже зарегистрированы как участник."
jury_already_registered = "Вы уже зарегистрированы как жюри."
user_reg_but_jury = "Вы зарегистрированы как участник, но у вас есть права, как у жюри. Вы разработчик!"

# Интерфейс жюри
check_unapprecieated_videos = "Проверить наличие видео"


user_agreement_text = """Пользовательское соглашение: Пожалуйста, внимательно ознакомьтесь с данным лицензионным соглашением перед использованием телеграм бота
1. Регистрация участников команды: Капитан команды, используя бота, имеет возможность регистрировать участников команды и управлять их данными. Капитан обязуется предоставлять только корректные и актуальные данные об участниках команды.
2. Отправка видео: Капитан команды имеет возможность отправлять боту видео в рамках участия в конкурсе. Бот обрабатывает и хранит видео исключительно в целях его дальнейшего использования в рамках конкурса и не передает его третьим лицам без согласия капитана команды.
3. Ответственность за контент: Капитан команды обязуется отправлять только видео, которые относятся к конкурсу и не нарущающие нормы этики и приличия.
4. Конфиденциальность данных: Обязательство бота и его администрации обеспечивать конфиденциальность и безопасность данных пользователей, включая персональную информацию, предоставленную ими при использовании бота.
5. Завершение использования: Пользователь в любое время может прекратить использование бота и удалить его из своего списка контактов.
6. Согласие с условиями: Используя данный бот, пользователь подтверждает свое согласие с условиями данного лицензионного соглашения.
С уважением,
Администрация бота """

just_sent_web_app = 'Вам отправлено окно для регистрации команды.'

text_after_disagreement = "бай-бай !"
